GetLinePattern Method
 Overload List
Name  |   Description
GetLinePattern
 Gets the LinePattern associated to this element.
GetLinePattern(Document, ElementId)
 Gets the LinePattern associated to an element or from a built-in line pattern.
 See Also
  LinePatternElement Class
  LinePatternElement Members
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →